nginx_benchmark/test/withKubearmor8_1000.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 20.102.0.96 (be patient).....done


Server Software:        
Server Hostname:        20.102.0.96
Server Port:            80

Document Path:          /hello-world-one
Document Length:        146 bytes

Concurrency Level:      100
Time taken for tests:   2.669 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      27400 bytes
HTML transferred:       14600 bytes
Requests per second:    37.47 [#/sec] (mean)
Time per request:       2668.759 [ms] (mean)
Time per request:       26.688 [ms] (mean, across all concurrent requests)
Transfer rate:          10.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      231  364 115.4    411    1235
Processing:   232  259  14.3    260     287
Waiting:      232  259  14.4    260     287
Total:        464  623 117.9    660    1472

Percentage of the requests served within a certain time (ms)
  50%    660
  66%    684
  75%    685
  80%    685
  90%    685
  95%    685
  98%    699
  99%   1472
 100%   1472 (longest request)