nginx_benchmark/test/withoutKubearmor3_100.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 20.102.0.96 (be patient).....done


Server Software:        
Server Hostname:        20.102.0.96
Server Port:            80

Document Path:          /hello-world-one
Document Length:        146 bytes

Concurrency Level:      100
Time taken for tests:   2.812 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      27400 bytes
HTML transferred:       14600 bytes
Requests per second:    35.56 [#/sec] (mean)
Time per request:       2811.873 [ms] (mean)
Time per request:       28.119 [ms] (mean, across all concurrent requests)
Transfer rate:          9.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      259  467 357.9    328    1332
Processing:   229 1000 752.2    410    1990
Waiting:      229  967 753.3    409    1990
Total:        496 1467 692.7   1543    2318

Percentage of the requests served within a certain time (ms)
  50%   1543
  66%   2169
  75%   2169
  80%   2169
  90%   2202
  95%   2219
  98%   2257
  99%   2318
 100%   2318 (longest request)