nginx_benchmark/test/withoutKubearmor4_100.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 20.102.0.96 (be patient).....done


Server Software:        
Server Hostname:        20.102.0.96
Server Port:            80

Document Path:          /hello-world-one
Document Length:        146 bytes

Concurrency Level:      100
Time taken for tests:   2.742 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      27400 bytes
HTML transferred:       14600 bytes
Requests per second:    36.47 [#/sec] (mean)
Time per request:       2742.096 [ms] (mean)
Time per request:       27.421 [ms] (mean, across all concurrent requests)
Transfer rate:          9.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      237  533 385.9    333    1329
Processing:   231  936 777.7    272    1940
Waiting:      231  924 778.5    272    1940
Total:        471 1469 685.5   1565    2273

Percentage of the requests served within a certain time (ms)
  50%   1565
  66%   2122
  75%   2159
  80%   2160
  90%   2190
  95%   2192
  98%   2223
  99%   2273
 100%   2273 (longest request)